micropython/micropython/ports/psoc6/modules/network/network_ifx_wcm.c
void network_deinit(void) {
    cy_rslt_t ret = cy_wcm_deinit();
    wcm_assert_raise("network deinit error (code: %d)", ret);
}

#define MAX_WIFI_RETRY_COUNT                (3u)
#define WIFI_CONN_RETRY_INTERVAL_MSEC       (100u)

// Network Access Point initialization with default network parameters
void network_ap_init() {
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    cy_wcm_ap_config_t *ap_conf = &(network_ifx_wcm_wl_ap.itf_obj.ap_obj.ap_config);
    cy_wcm_ip_setting_t *ap_ip_settings = &(network_ifx_wcm_wl_ap.itf_obj.ap_obj.ap_config.ip_settings);

    ap_conf->channel = NETWORK_WLAN_DEFAULT_CHANNEL;
    memcpy(ap_conf->ap_credentials.SSID, NETWORK_WLAN_DEFAULT_SSID, strlen(NETWORK_WLAN_DEFAULT_SSID) + 1);
    memcpy(ap_conf->ap_credentials.password, NETWORK_WLAN_DEFAULT_PASSWORD, strlen(NETWORK_WLAN_DEFAULT_PASSWORD) + 1);
    ap_conf->ap_credentials.security = NETWORK_WLAN_DEFAULT_SECURITY;

    cy_wcm_set_ap_ip_setting(ap_ip_settings, NETWORK_WLAN_AP_IP, NETWORK_WLAN_AP_NETMASK_IP, NETWORK_WLAN_AP_GATEWAY_IP, CY_WCM_IP_VER_V4);
    wcm_assert_raise("network ap ip setting error (code: %d)", ret);
}

// Network Initialization function (called from main.c)
void network_init(void) {
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    cy_wcm_config_t wcm_config = { .interface = CY_WCM_INTERFACE_TYPE_AP_STA };

    ret = cy_wcm_init(&wcm_config);
    wcm_assert_raise("network init error (code: %d)", ret);

    network_ap_init();
}

// Print after constructor invoked
STATIC void network_ifx_wcm_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    // network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(self_in);

    //     TODO: Implement print with following parameters
    //       - link status (requires tcpip stack integration)
    //       - get and print ip address
    const char *status_str = "network status unknown. To be implemented in network.status().";

    /*if (status == CYW43_LINK_DOWN) {
        status_str = "down";
    } else if (status == CYW43_LINK_JOIN || status == CYW43_LINK_NOIP) {
        status_str = "join";
    } else if (status == CYW43_LINK_UP) {
        status_str = "up";
    } else if (status == CYW43_LINK_NONET) {
        status_str = "nonet";
    } else if (status == CYW43_LINK_BADAUTH) {
        status_str = "badauth";
    } else {
        status_str = "fail";
    }*/

    mp_printf(print, "<IFX WCM %s %u.%u.%u.%u>",
        status_str,
        0, // netif->ip_addr.addr & 0xff,
        0, // netif->ip_addr.addr >> 8 & 0xff,
        0, // netif->ip_addr.addr >> 16 & 0xff,
        0 // netif->ip_addr.addr >> 24
        );
}

STATIC mp_obj_t network_ifx_wcm_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 0, 1, false);

    if (n_args == 0 || mp_obj_get_int(args[0]) == MOD_NETWORK_STA_IF) {
        return MP_OBJ_FROM_PTR(&network_ifx_wcm_wl_sta);
    } else {
        return MP_OBJ_FROM_PTR(&network_ifx_wcm_wl_ap);
    }
    return mp_const_none;
}

STATIC mp_obj_t network_ifx_wcm_send_ethernet(mp_obj_t self_in, mp_obj_t buf_in) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_buffer_info_t buf;
    mp_get_buffer_raise(buf_in, &buf, MP_BUFFER_READ);
    whd_buffer_t *whd_buff = (whd_buffer_t *)&buf;
    int ret = whd_network_send_ethernet_data(whd_ifs[self->itf], *whd_buff);
    wcm_assert_raise("network send ethernet error (code: %d)", ret);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(network_ifx_wcm_send_ethernet_obj, network_ifx_wcm_send_ethernet);

/*******************************************************************************/
// network API

STATIC mp_obj_t network_ifx_wcm_deinit(mp_obj_t self_in) {
    uint32_t ret = cy_wcm_deinit();
    wcm_assert_raise("network deinit error (code: %d)", ret);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(network_ifx_wcm_deinit_obj, network_ifx_wcm_deinit);

STATIC mp_obj_t network_ifx_wcm_active(size_t n_args, const mp_obj_t *args) {
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (self->itf == CY_WCM_INTERFACE_TYPE_STA) {
        if (n_args == 1) {
            return mp_obj_new_bool(cy_wcm_is_connected_to_ap());
        }
    } else if (self->itf == CY_WCM_INTERFACE_TYPE_AP) {
        if (n_args == 1) {
            return mp_obj_new_bool(cy_wcm_is_ap_up());
        } else {
            if (mp_obj_is_true(args[1])) {
                ret = cy_wcm_start_ap(&(self->itf_obj.ap_obj.ap_config));
                wcm_assert_raise("network ap active error (with code: %d)", ret);
            } else {
                ret = cy_wcm_stop_ap();
                wcm_assert_raise("network ap deactivate error (with code: %d)", ret);
            }
        }
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_ifx_wcm_active_obj, 1, 2, network_ifx_wcm_active);

typedef struct
{
    mp_obj_t scan_list;
    cy_wcm_scan_status_t status;
}scan_user_data_t;

// Callback function for scan method. After each scan result, the scan callback is executed.
static void network_ifx_wcm_scan_cb(cy_wcm_scan_result_t *result_ptr, void *user_data, cy_wcm_scan_status_t status) {
    scan_user_data_t *scan_user_data = (scan_user_data_t *)user_data;
    mp_obj_t *scan_list = scan_user_data->scan_list;
    uint8_t hidden_status = 1; // HIDDEN
    uint8_t security_type = 0; // OPEN

    if (status == CY_WCM_SCAN_INCOMPLETE) {
        // Get the network status : hidden(1) or open(0)
        if (strlen((const char *)result_ptr->SSID) != 0) {
            hidden_status = 0;
        }

        // Get security type as mapped in micropython function description
        get_security_string_and_type(result_ptr, &security_type);

        mp_obj_t tuple[6] = {
            mp_obj_new_bytes(result_ptr->SSID, strlen((const char *)result_ptr->SSID)),
            mp_obj_new_bytes(result_ptr->BSSID, CY_WCM_MAC_ADDR_LEN),
            MP_OBJ_NEW_SMALL_INT(result_ptr->channel),
            MP_OBJ_NEW_SMALL_INT(result_ptr->signal_strength),
            MP_OBJ_NEW_SMALL_INT(security_type),
            MP_OBJ_NEW_SMALL_INT(hidden_status)
        };
        mp_obj_list_append(scan_list, mp_obj_new_tuple(6, tuple));
    }

