micropython/micropython/ports/psoc6/modules/network/network_ifx_wcm.c
    scan_user_data->status = status;
    return;
}

STATIC mp_obj_t network_ifx_wcm_scan(size_t n_args, const mp_obj_t *args, mp_map_t *kwargs) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    cy_rslt_t ret = CY_RSLT_SUCCESS;
    cy_wcm_scan_filter_t scan_filter;
    bool is_filter_used = false;

    if (self->itf != CY_WCM_INTERFACE_TYPE_STA) {
        mp_raise_ValueError(MP_ERROR_TEXT("network STA required"));
    }

    if (n_args != 1) {
        mp_raise_TypeError(MP_ERROR_TEXT("network scan accepts no query parameters"));
    }

    if (kwargs->used != 0) {
        if (kwargs->alloc != 1) {
            mp_raise_TypeError(MP_ERROR_TEXT("network scan only accepts one filter mode"));
        }

        is_filter_used = true;
        mp_map_elem_t *e = &kwargs->table[0];
        switch (mp_obj_str_get_qstr(e->key))
        {
            case MP_QSTR_ssid: {
                scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_SSID;
                size_t len;
                const char *ssid = mp_obj_str_get_data(e->value, &len);
                len = MIN(len, CY_WCM_MAX_SSID_LEN + 1);
                memcpy(scan_filter.param.SSID, ssid, len);
                memset(&scan_filter.param.SSID[len], 0, 1); // null terminated str.
                break;
            }

            case MP_QSTR_bssid: {
                scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_MAC;
                mp_buffer_info_t bssid;
                mp_get_buffer(e->value, &bssid, MP_BUFFER_READ);
                if (bssid.len != CY_WCM_MAC_ADDR_LEN) {
                    mp_raise_ValueError(MP_ERROR_TEXT("bssid address invalid length"));
                }
                memcpy(scan_filter.param.BSSID, bssid.buf, bssid.len);
                break;
            }

            default:
                mp_raise_ValueError(MP_ERROR_TEXT("unknown config param"));
        }
    }

    mp_obj_t res = mp_obj_new_list(0, NULL);
    void *ntwk_scan_result = MP_OBJ_TO_PTR(res);
    scan_user_data_t scan_user_params;
    scan_user_params.scan_list = MP_OBJ_FROM_PTR(ntwk_scan_result);

    cy_wcm_scan_filter_t *scan_filter_ptr = NULL;
    if (is_filter_used) {
        scan_filter_ptr = &scan_filter;
    }

    ret = cy_wcm_start_scan(network_ifx_wcm_scan_cb, (void *)&scan_user_params, scan_filter_ptr);
    wcm_assert_raise("network scan error (with code: %d)", ret);

    while (scan_user_params.status == CY_WCM_SCAN_INCOMPLETE /*|| TODO: timeout_expired */) {
    }

    return res;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(network_ifx_wcm_scan_obj, 1, network_ifx_wcm_scan);

STATIC mp_obj_t network_ifx_wcm_connect(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_ssid, ARG_key, ARG_auth, ARG_security, ARG_bssid, ARG_channel };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_ssid, MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_key, MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_auth, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_security, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_bssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_channel, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
    };


    /* Maximum Wi-Fi re-connection limit. */
    #define MAX_WIFI_CONN_RETRIES             (120u)

    /* Wi-Fi re-connection time interval in milliseconds. */
    #define WIFI_CONN_RETRY_INTERVAL_MS       (5000)

    #define WIFI_CONNECTED                   (1lu << 1)

    /* Flag to denote initialization status of various operations. */
    // uint32_t status_flag;

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_wcm_connect_params_t connect_param;
    cy_wcm_ip_address_t ipaddress;
    memset(&connect_param, 0, sizeof(cy_wcm_connect_params_t));

    // Deprecated kwarg
    if (args[ARG_auth].u_int != -1) {
        args[ARG_security] = args[ARG_auth];
    }

    // Extract the SSID.
    mp_buffer_info_t ssid;
    mp_get_buffer_raise(args[ARG_ssid].u_obj, &ssid, MP_BUFFER_READ);
    // TODO: Check length cannot be more than 32 bytes. Limited by whd lib. Validate argument!
    memcpy(connect_param.ap_credentials.SSID, ssid.buf, ssid.len);

    // Extract the key, if given.
    mp_buffer_info_t key;
    key.buf = NULL;
    if (args[ARG_key].u_obj != mp_const_none) {
        mp_get_buffer_raise(args[ARG_key].u_obj, &key, MP_BUFFER_READ);
    }
    memcpy(connect_param.ap_credentials.password, key.buf, key.len);

    // // Extract the BSSID, if given.
    // mp_buffer_info_t bssid;
    // bssid.buf = NULL;
    // if (args[ARG_bssid].u_obj != mp_const_none) {
    //     mp_get_buffer_raise(args[ARG_bssid].u_obj, &bssid, MP_BUFFER_READ);
    //     cy_wcm_mac_t wcm_bssid;

    //     // Check if the given bssid matches the interface bssid
    //     uint32_t ret = whd_wifi_get_bssid(itf, &wcm_bssid);
    //     wcm_assert_raise(ret);

    //     if (bssid.len != 6) {
    //         if (strncmp(bssid.buf, (char *)whd_bssid.octet, 6)) {
    //             mp_raise_ValueError(NULL);
    //         }
    //     }
    // }

    // Extract the security type, if given.
    cy_wcm_security_t auth_type;
    if (args[ARG_security].u_int == -1) {
        if (key.buf == NULL || key.len == 0) {
            auth_type = CY_WCM_SECURITY_OPEN;
        } else {
            auth_type = CY_WCM_SECURITY_WPA2_AES_PSK;
        }
    } else {
        auth_type = args[ARG_security].u_int;
    }
    connect_param.ap_credentials.security = auth_type;

    // // Extract channel, if given.
    // if (args[ARG_channel].u_int == -1) {

    //     uint32_t ret = whd_wifi_set_channel(itf, args[ARG_channel].u_int);
    //     wcm_assert_raise(ret);
    // }

    /* Connect to the Wi-Fi AP. */
    for (uint32_t retry_count = 0; retry_count < MAX_WIFI_CONN_RETRIES; retry_count++)
    {
        result = cy_wcm_connect_ap(&connect_param, &ipaddress);

        if (result == CY_RSLT_SUCCESS) {
            // printf("\nSuccessfully connected to Wi-Fi network '%s'.\n", connect_param.ap_credentials.SSID);
            return mp_const_none;
        }
        printf("Connection to Wi-Fi network failed with error code 0x%0X. Retrying in %d ms. Retries left: %d\n",
            (int)result, WIFI_CONN_RETRY_INTERVAL_MS, (int)(MAX_WIFI_CONN_RETRIES - retry_count - 1));

