micropython/micropython/ports/psoc6/modules/network/network_ifx_wcm.c
    }
    printf("\nExceeded maximum Wi-Fi connection attempts!\n");
    printf("Wi-Fi connection failed after retrying for %d mins\n\n",
        (int)(WIFI_CONN_RETRY_INTERVAL_MS * MAX_WIFI_CONN_RETRIES) / 60000u);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(network_ifx_wcm_connect_obj, 1, network_ifx_wcm_connect);

STATIC mp_obj_t network_ifx_wcm_disconnect(mp_obj_t self_in) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (self->itf != CY_WCM_INTERFACE_TYPE_STA) {
        mp_raise_ValueError(MP_ERROR_TEXT("network STA required"));
    }
    uint32_t ret = cy_wcm_disconnect_ap();
    wcm_assert_raise("msg tbd", ret);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(network_ifx_wcm_disconnect_obj, network_ifx_wcm_disconnect);

STATIC mp_obj_t network_ifx_wcm_isconnected(mp_obj_t self_in) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (self->itf == CY_WCM_INTERFACE_TYPE_STA) {
        return mp_obj_new_bool(cy_wcm_is_connected_to_ap());
    } else if (self->itf == CY_WCM_INTERFACE_TYPE_AP) {
        /* True if at least one client is connected */
        bool is_a_sta_connected = false;
        cy_wcm_mac_t sta[1] = {0};
        cy_wcm_mac_t not_conn_sta = {0, 0, 0, 0, 0, 0};
        uint32_t ret = cy_wcm_get_associated_client_list(sta, 1);
        wcm_assert_raise("network ap isconnected error (with code: %d)", ret);
        if (memcmp(&sta[0], &not_conn_sta, CY_WCM_MAC_ADDR_LEN) != 0) {
            is_a_sta_connected = true;
        }

        return mp_obj_new_bool(is_a_sta_connected);
    }

    return mp_const_none;
}

STATIC MP_DEFINE_CONST_FUN_OBJ_1(network_ifx_wcm_isconnected_obj, network_ifx_wcm_isconnected);

STATIC mp_obj_t network_ifx_wcm_ifconfig(size_t n_args, const mp_obj_t *args) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    if (n_args == 1) {
        const ip_addr_t *dns = dns_getserver(0);
        cy_wcm_get_ip_addr(self->itf, &ip_address);
        cy_wcm_get_gateway_ip_address(self->itf, &gateway_addr);
        cy_wcm_get_ip_netmask(self->itf, &net_mask_addr);
        mp_obj_t tuple[4] = {
            mp_obj_new_str(ip4addr_ntoa((const ip4_addr_t *)&ip_address.ip.v4), strlen(ip4addr_ntoa((const ip4_addr_t *)&ip_address.ip.v4))),
            mp_obj_new_str(ip4addr_ntoa((const ip4_addr_t *)&net_mask_addr.ip.v4), strlen(ip4addr_ntoa((const ip4_addr_t *)&net_mask_addr.ip.v4))),
            mp_obj_new_str(ip4addr_ntoa((const ip4_addr_t *)&gateway_addr.ip.v4), strlen(ip4addr_ntoa((const ip4_addr_t *)&gateway_addr.ip.v4))),
            netutils_format_ipv4_addr((uint8_t *)dns, NETUTILS_BIG),
        };
        return mp_obj_new_tuple(4, tuple);
    } else {
        const mp_obj_t *argss = args + 1;
        mp_obj_t *items;
        mp_obj_get_array_fixed_n(argss[0], 4, &items);
        cy_rslt_t res = cy_wcm_set_ap_ip_setting(&ap_ip, items[0], items[1], items[2], CY_WCM_IP_VER_V4);
        ip_addr_t dns;
        netutils_parse_ipv4_addr(items[3], (uint8_t *)&dns, NETUTILS_BIG);
        dns_setserver(0, &dns);
        if (res == CY_RSLT_SUCCESS) {
            mp_printf(&mp_plat_print, "successfully configured");
        }
    }

    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_ifx_wcm_ifconfig_obj, 1, 2, network_ifx_wcm_ifconfig);

STATIC mp_obj_t network_ifx_wcm_status(size_t n_args, const mp_obj_t *args) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (n_args == 1) {
        // no arguments: return link status
        return MP_OBJ_NEW_SMALL_INT(cy_wcm_is_connected_to_ap());
    }

    // one argument: return status based on query parameter
    switch (mp_obj_str_get_qstr(args[1])) {
        case MP_QSTR_stations: {
            if (self->itf != CY_WCM_INTERFACE_TYPE_AP) {
                mp_raise_ValueError(MP_ERROR_TEXT("AP required"));
            }
            // uint8_t max_sta = NETWORK_WLAN_MAX_AP_STATIONS;
            cy_wcm_mac_t sta_list[NETWORK_WLAN_MAX_AP_STATIONS];
            uint32_t ret = cy_wcm_get_associated_client_list(&sta_list[0], NETWORK_WLAN_MAX_AP_STATIONS);
            wcm_assert_raise("network status error (with code: %d)", ret);

            mp_obj_t list = mp_obj_new_list(NETWORK_WLAN_MAX_AP_STATIONS, NULL);
            for (int i = 0; i < NETWORK_WLAN_MAX_AP_STATIONS; ++i) {
                mp_obj_t tuple[1] = {
                    mp_obj_new_bytes(sta_list[i], 6),
                };
                ((mp_obj_list_t *)MP_OBJ_TO_PTR(list))->items[i] = mp_obj_new_tuple(1, tuple);
            }
            return list;
        }
    }

    mp_raise_ValueError(MP_ERROR_TEXT("unknown status param"));
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_ifx_wcm_status_obj, 1, 2, network_ifx_wcm_status);

static inline uint32_t nw_get_le32(const uint8_t *buf) {
    return buf[0] | buf[1] << 8 | buf[2] << 16 | buf[3] << 24;
}

static inline void nw_put_le32(uint8_t *buf, uint32_t x) {
    buf[0] = x;
    buf[1] = x >> 8;
    buf[2] = x >> 16;
    buf[3] = x >> 24;
}

STATIC mp_obj_t network_ifx_wcm_config(size_t n_args, const mp_obj_t *args, mp_map_t *kwargs) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (kwargs->used == 0) {
        // Get config value
        if (n_args != 2) {
            mp_raise_TypeError(MP_ERROR_TEXT("must query one param"));
        }

        switch (mp_obj_str_get_qstr(args[1])) {
            case MP_QSTR_antenna: {
                uint8_t buf[4];
                uint32_t ret = whd_wifi_get_ioctl_buffer(whd_ifs[self->itf], WLC_GET_ANTDIV, buf, 4);
                wcm_assert_raise("msg tbd", ret);

                return MP_OBJ_NEW_SMALL_INT(nw_get_le32(buf));
            }
            case MP_QSTR_channel: {
                uint32_t channel;
                uint32_t ret = whd_wifi_get_channel(whd_ifs[self->itf], &channel);
                wcm_assert_raise("msg tbd",  ret);

                return MP_OBJ_NEW_SMALL_INT(channel);
            }
            case MP_QSTR_ssid:
            case MP_QSTR_essid: {
                wl_bss_info_t bss_info;
                uint32_t ret = whd_wifi_get_bss_info(whd_ifs[self->itf], &bss_info);
                wcm_assert_raise("msg tbd", ret);

                return mp_obj_new_str((const char *)bss_info.SSID, bss_info.SSID_len);
            }

            case MP_QSTR_security: {
                whd_security_t security;
                uint32_t ret = whd_wifi_get_ap_info(whd_ifs[self->itf], NULL, &security);
                wcm_assert_raise("msg tbd", ret);

